{
    "use_turkish": "Türkçe kullan",
    "try_now": "Deneyebilecekleriniz",
    "others": "Diğerleri",
    "api": {
        "title": "API & Auth",
        "explanation": "Dio, GraphQL ve Fresh kullanarak token yenileme ve soket desteği ile Rest ve GraphQL desteği."
    },
    "performance": {
        "title": "Performance",
        "explanation": "Sayfa geçişleri veya karmaşık listelerin hızlı kaydırılması gibi yapıların neden olduğu gecikmeler için keframe aracılığıyla performans optimize edilmiştir."
    },
    "state": {
        "title": "State & Architecture",
        "explanation": "BLoC & Hydrated Bloc, kalıcı ve güçlü state yönetimi oluşturarak Business Logic'i UI'den ayırmaya yardımcı olur."
    },
    "linting": {
        "title": "Linting",
        "explanation": "Kodun sağlığını yüksek ve dart standartlarına uygun tutmak için ayrıntılı ayarlara sahip katı linting kuralları."
    },
    "type_safety": {
        "title": "Type Safety",
        "explanation": "Bu proje type-safe kod yazmayı önceliği haline getirerek (languages ,assets, gibi.) hataları uygulama çalışırken değil, uygulama derlenmeden farketmenizi sağlar."
    },
    "forms": {
        "title": "Forms",
        "explanation": "Formları oluşturmak ve yönetmek hiç bu kadar kolay ve eğlenceli olmamıştı. Reaktif formlar, form girdilerini ve doğrulamalarını işlemek için model odaklı bir yaklaşım kullanır."
    },
    "testing": {
        "title": "Testing",
        "explanation": "Uygulamada ne kadar çok özellik varsa, manuel olarak test etmek o kadar zor olur. Otomatik testler, (Bloc Test, Golden Tookit ve Mocktail) uygulamanızı yayınlamadan önce doğru şekilde çalıştığından emin olmanıız sağlar."
    },
    "di_locator": {
        "title": "DI & Locator",
        "explanation": "Injectable ve GetIt ile class'lar arasındaki sıkı bağlantıyı azaltıp, yeniden kod kullanılabilirliğini artırın."
    },
    "code_generation": {
        "title": "Code Generation",
        "explanation": "Freezed, Artemis ve Build Runner ile veri sınıfları oluşturarak üretkenliği en üst düzeye çıkarın ve kod kalitesini yükseltin."
    },
    "ci_cd": {
        "title": "CI & CD Integration",
        "explanation": "CI/CD, Codemagic, en verimli deploy yöntemiyle sürekli yeni özellikler ve hata düzeltmeleri akışı sağlamak için kullanılır. Böylece yeni versiyon yayınlamanız kolaylaşır."
    },
    "routing": {
        "title": "Routing",
        "explanation": "AutoRouter, strongly-typed argümanlar oluşturmayı, zahmetsizce deep-linking yapmayı ve routing mekanizmasını basitleştirmenizi sağlar."
    },
    "pattern": {
        "title": "Design Pattern",
        "explanation": "Repository dizayn patterni, veri katmanının karmaşıklığını azaltır, yapılandırılmamış verileri uygulamanın geri kalanından yalıtır ve proje yapısını düzenler."
    },
    "exceptions": {
        "title": "Exceptions",
        "explanation": "Her işlemde try ve catch kullanarak exception'ları işlemek çok ideal bir çözüm değildir, Data Channel exception'ları işlemek ve veri yönlendirmek için yardımcı program sağlar."
    },
    "storage": {
        "title": "Storage",
        "explanation": "Hive ve Secure Storage ile saf Dart ile yazılmış, son derece hızlı ve şifreli anahtar-değer veritabanı."
    },
    "dynamic_theme": {
        "title": "Dynamic Theme",
        "explanation": "Android 12 ve Material You ile, uygulamayı renklendirmek için kullanılabilecek bir ColorScheme oluşturmak için duvar kağıdı renkleri çıkarılabilir."
    },
    "localization": {
        "title": "Localization",
        "explanation": "Context gerektirmeden ve variable keys desteğiyle basitçe json dosyaları oluşturarak uygulamayı diğer dillere kolayca yerelleştirin."
    },
    "permission": {
        "title": "Permission",
        "explanation": "Bu proje ayrıca izin isteme ve izin durumu bilgilerini kontrol etmek için permission_handler ile platformlar arası (iOS, Android) bir örnek sağlar."
    },
    "env_variables": {
        "title": "Env Variables",
        "explanation": "Environmental variables, API anahtarları, temel URL'ler ve benzeri şeyler için uygulamada paylaşılan genel bilgileri tanımlamaya olanak tanır."
    },
    "logging": {
        "title": "Logging & Tracking",
        "explanation": "Uygulamada gerçekleşen işlem ve hataları gerçek zamanlı takip edebilmek için Logging ve Sentry ile detaylı bir loglama mekanizması."
    },
    "native_splash": {
        "title": "Native Splash",
        "explanation": "Flutter Native Splash, açılış ekranını, arka plan rengini ve açılış görüntüsünü özelleştirmek için iOS, Android ve Web'de native kodu otomatik olarak oluşturur."
    },
    "refresh_rate": {
        "title": "Refresh Rate",
        "explanation": "Flutter displaymode paketiyle yüksek yenileme hızına sahip ekranlar için destek."
    }
}