{
  "failures": {
    "network": {
      "badCertificate": "The server certificate is not valid. Please check the server's security certificate and try again.",
      "badRequest": "The request was not formatted correctly and could not be understood. Please check the request format and try again.",
      "badResponse": "The server responded with an unexpected format or status code. Please check the response and try again.",
      "clientError": "A client error occurred. Please check the request and try again.",
      "connection": "Failed to connect to the server. Please check your network connection and try again.",
      "connectionTimeout": "The connection timed out while attempting to reach the server. Please check your network settings and try again.",
      "forbidden": "The request was valid, but the server is refusing action. Please check your permissions and try again.",
      "internalServer": "The server encountered an unexpected condition that prevented it from fulfilling the request. Please try again later.",
      "noNetwork": "No network connection. Please check your internet connection and try again.",
      "notFound": "The requested resource could not be found. Please check the URL and try again.",
      "receiveTimeout": "The server took too long to send a response. Please check your connection and try again.",
      "requestCancel": "The request was cancelled. Please check your request and try again.",
      "requestTimeout": "The server timed out waiting for the request. Please attempt to reconnect and try again.",
      "sendTimeout": "The request timed out while trying to send data. Please check your connection and try again.",
      "serverError": "The server encountered a condition which prevented it from fulfilling the request. Please try again later.",
      "timeout": "The network request timed out. Please check your connection and try again.",
      "tooManyRequests": "The user has sent too many requests in a given amount of time. Please wait before trying again.",
      "unauthorized": "Authentication is required and has failed or has not been provided. Please verify your credentials and try again.",
      "unexpected": "An unexpected network error occurred. Please check your connection and try again.",
      "unexpectedTokenRefresh": "An unexpected error occurred while refreshing the authentication token. Please re-authenticate and try again."
    }
  }
}